#Analiza i Bazy Danych

Maciej Wieloch, 303080

gr. 1a

Wykonaj zapytania za pomocą skryptów pythona:

1. Ile kategorii filmów mamy w wypożyczalni?
2. Wyświetl listę kategorii w kolejności alfabetycznej.
3. Znajdź najstarszy i najmłodszy film do wypożyczenia.
4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?
5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?
6. Znajdź największą płatność wypożyczenia.
7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.
8. Gdzie mieszkają członkowie personelu?
9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?
10. Jakie kategorie filmów zostały wypożyczone przez klientów?
11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.
12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [5]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

1. Ile kategorii filmów mamy w wypożyczalni?

In [15]:
df = pd.read_sql('select category_id from category order by category_id desc limit 1',con=connection)
print(df)

   category_id
0           16

2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [16]:
df = pd.read_sql('select name from category order by name asc',con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

a) najstarszy

In [33]:
df = pd.read_sql('select title, release_year, length from film order by release_year desc limit 1',con=connection)
print(df)

             title  release_year  length
0  Chamber Italian          2006     117

b) najmłodszy

In [32]:
df = pd.read_sql('select title, release_year, length from film order by release_year asc limit 1',con=connection)
print(df)

             title  release_year  length
0  Chamber Italian          2006     117

Wszystkie filmy są z tego samego roku zatem niezależnie od formuły, wyświetla się ten sam rekord.

4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [44]:
df = pd.read_sql("select count(*) from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)
print(df)

   count
0   7380

5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [70]:
df = pd.read_sql("select count(*) from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)
print(df)

   count
0      0

6. Znajdź największą płatność wypożyczenia.

In [82]:
df = pd.read_sql('select amount from payment order by amount desc limit 1',con=connection)
print(df)

   amount
0   11.99

In [ ]:
7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

a) Polska

In [84]:
df = pd.read_sql("select * from customer c left join address a on c.address_id = a.address_id left join city ci on a.city_id = ci.city_id left join country co on ci.country_id = co.country_id where co.country='Poland'",con=connection)
print(df)

   customer_id  store_id first_name  ... country_id country         last_update
0          318         1      Brian  ...         76  Poland 2006-02-15 09:44:00
1          572         1     Sidney  ...         76  Poland 2006-02-15 09:44:00
2          128         1   Marjorie  ...         76  Poland 2006-02-15 09:44:00
3          270         1       Leah  ...         76  Poland 2006-02-15 09:44:00
4          501         1      Ruben  ...         76  Poland 2006-02-15 09:44:00
5          571         2    Johnnie  ...         76  Poland 2006-02-15 09:44:00
6          380         1    Russell  ...         76  Poland 2006-02-15 09:44:00
7          558         1     Jimmie  ...         76  Poland 2006-02-15 09:44:00

[8 rows x 25 columns]

In [ ]:
|)